nazililham11/Quadpod/src/ATmega128_pins.h
#define PORT_A_0 44  
#define PORT_A_1 43
#define PORT_A_2 42
#define PORT_A_3 41  
#define PORT_A_4 40
#define PORT_A_5 39
#define PORT_A_6 38  
#define PORT_A_7 38

#define PORT_B_0 8      //SS
#define PORT_B_1 9      //SCK
#define PORT_B_2 10     //MOSI
#define PORT_B_3 11     //MISO
#define PORT_B_4 12
#define PORT_B_5 13
#define PORT_B_6 14  
#define PORT_B_7 15

#define PORT_C_0 28  
#define PORT_C_1 29
#define PORT_C_2 30
#define PORT_C_3 31 
#define PORT_C_4 32
#define PORT_C_5 33
#define PORT_C_6 34  
#define PORT_C_7 35

#define PORT_D_0 18     //SDA
#define PORT_D_1 19     //SCL
#define PORT_D_2 20     //RX1
#define PORT_D_3 21     //TX1
#define PORT_D_4 22
#define PORT_D_5 23
#define PORT_D_6 24  
#define PORT_D_7 25

#define PORT_E_0 0      //RX0
#define PORT_E_1 1      //TX0
#define PORT_E_2 2
#define PORT_E_3 3 
#define PORT_E_4 4
#define PORT_E_5 5
#define PORT_E_6 6  
#define PORT_E_7 7

#define PORT_F_0 45     //Analog 0
#define PORT_F_1 46     //Analog 1
#define PORT_F_2 47     //Analog 2
#define PORT_F_3 48     //Analog 3
#define PORT_F_4 49     //Analog 4
#define PORT_F_5 50     //Analog 5
#define PORT_F_6 51     //Analog 6
#define PORT_F_7 52     //Analog 7

#define PORT_G_0 26
#define PORT_G_1 27
#define PORT_G_2 36
#define PORT_G_3 16
#define PORT_G_4 17
#define PORT_G_5 53
